[
  {
    "title": "1984",
    "summary_short": "A dystopian story about a totalitarian regime built on surveillance, propaganda, and fear. Winston secretly longs for truth and freedom while living under Big Brother. Themes: control, manipulation, resistance, freedom, truth."
  },
  {
    "title": "The Hobbit",
    "summary_short": "A timid hobbit joins dwarves on a quest to reclaim a stolen treasure from a dragon. On the road he discovers courage, wit, and loyal friends. Themes: adventure, friendship, courage, growth."
  },
  {
    "title": "The Fellowship of the Ring",
    "summary_short": "A small band sets out to destroy a powerful ring that could doom the world. Bonds are tested as darkness spreads. Themes: friendship, sacrifice, temptation, hope."
  },
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "summary_short": "An orphan discovers he’s a wizard and finds a new home at Hogwarts. Together with friends, he confronts danger and uncovers secrets about his past. Themes: friendship, courage, magic, identity."
  },
  {
    "title": "To Kill a Mockingbird",
    "summary_short": "A child witnesses racism and injustice in a small Southern town as her father defends an innocent man. Themes: justice, empathy, morality, coming-of-age."
  },
  {
    "title": "The Little Prince",
    "summary_short": "A pilot meets a mysterious boy from another world who questions adult logic and values. Themes: innocence, friendship, love, meaning."
  },
  {
    "title": "The Book Thief",
    "summary_short": "A girl in Nazi Germany finds solace in books while war and loss reshape her life. Themes: war, friendship, words, courage, humanity."
  },
  {
    "title": "Dune",
    "summary_short": "A young heir is thrust into a desert world of rival houses, prophecy, and scarce resources. Themes: power, ecology, destiny, politics, survival."
  },
  {
    "title": "Pride and Prejudice",
    "summary_short": "Manners, misjudgments, and evolving feelings entangle Elizabeth Bennet and Mr. Darcy. Themes: love, class, reputation, personal growth."
  },
  {
    "title": "The Alchemist",
    "summary_short": "A shepherd follows a recurring dream across deserts to find his Personal Legend. Themes: destiny, self-discovery, spirituality, perseverance."
  },
  {
    "title": "The Lion, the Witch and the Wardrobe",
    "summary_short": "Siblings enter a magical land frozen by an evil witch and join a noble lion to restore hope. Themes: courage, faith, sacrifice, redemption, friendship."
  },
  {
    "title": "The Catcher in the Rye",
    "summary_short": "A restless teen wanders New York City, wrestling with grief, alienation, and adulthood. Themes: identity, alienation, innocence, coming-of-age."
  }
]
